20260422_051015/webflux-io-200-run1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: io-bound-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 006/200 VUs, 56 complete and 0 interrupted iterations
default   [   0% ] 006/200 VUs  0m00.9s/4m00.0s

running (0m01.9s), 013/200 VUs, 246 complete and 0 interrupted iterations
default   [   1% ] 013/200 VUs  0m01.9s/4m00.0s

running (0m02.9s), 020/200 VUs, 560 complete and 0 interrupted iterations
default   [   1% ] 020/200 VUs  0m02.9s/4m00.0s

running (0m03.9s), 026/200 VUs, 1006 complete and 0 interrupted iterations
default   [   2% ] 026/200 VUs  0m03.9s/4m00.0s

running (0m04.9s), 033/200 VUs, 1570 complete and 0 interrupted iterations
default   [   2% ] 033/200 VUs  0m04.9s/4m00.0s

running (0m05.9s), 040/200 VUs, 2279 complete and 0 interrupted iterations
default   [   2% ] 040/200 VUs  0m05.9s/4m00.0s

running (0m06.9s), 046/200 VUs, 3094 complete and 0 interrupted iterations
default   [   3% ] 046/200 VUs  0m06.9s/4m00.0s

running (0m07.9s), 053/200 VUs, 4062 complete and 0 interrupted iterations
default   [   3% ] 053/200 VUs  0m07.9s/4m00.0s

running (0m08.9s), 060/200 VUs, 5028 complete and 0 interrupted iterations
default   [   4% ] 060/200 VUs  0m08.9s/4m00.0s

running (0m09.9s), 066/200 VUs, 6022 complete and 0 interrupted iterations
default   [   4% ] 066/200 VUs  0m09.9s/4m00.0s

running (0m10.9s), 073/200 VUs, 7012 complete and 0 interrupted iterations
default   [   5% ] 073/200 VUs  0m10.9s/4m00.0s

running (0m11.9s), 079/200 VUs, 7972 complete and 0 interrupted iterations
default   [   5% ] 079/200 VUs  0m11.9s/4m00.0s

running (0m12.9s), 086/200 VUs, 8965 complete and 0 interrupted iterations
default   [   5% ] 086/200 VUs  0m12.9s/4m00.0s

running (0m13.9s), 093/200 VUs, 9922 complete and 0 interrupted iterations
default   [   6% ] 093/200 VUs  0m13.9s/4m00.0s

running (0m14.9s), 099/200 VUs, 10922 complete and 0 interrupted iterations
default   [   6% ] 099/200 VUs  0m14.9s/4m00.0s

running (0m15.9s), 106/200 VUs, 11875 complete and 0 interrupted iterations
default   [   7% ] 106/200 VUs  0m15.9s/4m00.0s

running (0m16.9s), 113/200 VUs, 12872 complete and 0 interrupted iterations
default   [   7% ] 113/200 VUs  0m16.9s/4m00.0s

running (0m17.9s), 119/200 VUs, 13869 complete and 0 interrupted iterations
default   [   7% ] 119/200 VUs  0m17.9s/4m00.0s

running (0m18.9s), 126/200 VUs, 14822 complete and 0 interrupted iterations
default   [   8% ] 126/200 VUs  0m18.9s/4m00.0s

running (0m19.9s), 133/200 VUs, 15822 complete and 0 interrupted iterations
default   [   8% ] 133/200 VUs  0m19.9s/4m00.0s

running (0m20.9s), 139/200 VUs, 16775 complete and 0 interrupted iterations
default   [   9% ] 139/200 VUs  0m20.9s/4m00.0s

running (0m21.9s), 146/200 VUs, 17772 complete and 0 interrupted iterations
default   [   9% ] 146/200 VUs  0m21.9s/4m00.0s

running (0m22.9s), 152/200 VUs, 18770 complete and 0 interrupted iterations
default   [  10% ] 152/200 VUs  0m22.9s/4m00.0s

running (0m23.9s), 159/200 VUs, 19725 complete and 0 interrupted iterations
default   [  10% ] 159/200 VUs  0m23.9s/4m00.0s

running (0m24.9s), 166/200 VUs, 20722 complete and 0 interrupted iterations
default   [  10% ] 166/200 VUs  0m24.9s/4m00.0s

running (0m25.9s), 172/200 VUs, 21675 complete and 0 interrupted iterations
default   [  11% ] 172/200 VUs  0m25.9s/4m00.0s

running (0m26.9s), 179/200 VUs, 22672 complete and 0 interrupted iterations
default   [  11% ] 179/200 VUs  0m26.9s/4m00.0s

running (0m27.9s), 186/200 VUs, 23651 complete and 0 interrupted iterations
default   [  12% ] 186/200 VUs  0m27.9s/4m00.0s

running (0m28.9s), 192/200 VUs, 24625 complete and 0 interrupted iterations
default   [  12% ] 192/200 VUs  0m28.9s/4m00.0s

running (0m29.9s), 199/200 VUs, 25622 complete and 0 interrupted iterations
default   [  12% ] 199/200 VUs  0m29.9s/4m00.0s

running (0m30.9s), 200/200 VUs, 26575 complete and 0 interrupted iterations
default   [  13% ] 200/200 VUs  0m30.9s/4m00.0s

running (0m31.9s), 200/200 VUs, 27572 complete and 0 interrupted iterations
default   [  13% ] 200/200 VUs  0m31.9s/4m00.0s

running (0m32.9s), 200/200 VUs, 28527 complete and 0 interrupted iterations
default   [  14% ] 200/200 VUs  0m32.9s/4m00.0s

running (0m33.9s), 200/200 VUs, 29525 complete and 0 interrupted iterations
default   [  14% ] 200/200 VUs  0m33.9s/4m00.0s

running (0m34.9s), 200/200 VUs, 30522 complete and 0 interrupted iterations
default   [  15% ] 200/200 VUs  0m34.9s/4m00.0s

running (0m35.9s), 200/200 VUs, 31475 complete and 0 interrupted iterations
default   [  15% ] 200/200 VUs  0m35.9s/4m00.0s

running (0m36.9s), 200/200 VUs, 32475 complete and 0 interrupted iterations
default   [  15% ] 200/200 VUs  0m36.9s/4m00.0s

running (0m37.9s), 200/200 VUs, 33425 complete and 0 interrupted iterations
default   [  16% ] 200/200 VUs  0m37.9s/4m00.0s

running (0m38.9s), 200/200 VUs, 34425 complete and 0 interrupted iterations
default   [  16% ] 200/200 VUs  0m38.9s/4m00.0s

running (0m39.9s), 200/200 VUs, 35402 complete and 0 interrupted iterations
default   [  17% ] 200/200 VUs  0m39.9s/4m00.0s

running (0m40.9s), 200/200 VUs, 36375 complete and 0 interrupted iterations
default   [  17% ] 200/200 VUs  0m40.9s/4m00.0s

running (0m41.9s), 200/200 VUs, 37375 complete and 0 interrupted iterations
default   [  17% ] 200/200 VUs  0m41.9s/4m00.0s

running (0m42.9s), 200/200 VUs, 38325 complete and 0 interrupted iterations
default   [  18% ] 200/200 VUs  0m42.9s/4m00.0s

running (0m43.9s), 200/200 VUs, 39325 complete and 0 interrupted iterations
default   [  18% ] 200/200 VUs  0m43.9s/4m00.0s

running (0m44.9s), 200/200 VUs, 40291 complete and 0 interrupted iterations
default   [  19% ] 200/200 VUs  0m44.9s/4m00.0s

running (0m45.9s), 200/200 VUs, 41275 complete and 0 interrupted iterations
default   [  19% ] 200/200 VUs  0m45.9s/4m00.0s

running (0m46.9s), 200/200 VUs, 42237 complete and 0 interrupted iterations
default   [  20% ] 200/200 VUs  0m46.9s/4m00.0s

running (0m47.9s), 200/200 VUs, 43225 complete and 0 interrupted iterations
default   [  20% ] 200/200 VUs  0m47.9s/4m00.0s

running (0m48.9s), 200/200 VUs, 44225 complete and 0 interrupted iterations
default   [  20% ] 200/200 VUs  0m48.9s/4m00.0s

running (0m49.9s), 200/200 VUs, 45175 complete and 0 interrupted iterations
default   [  21% ] 200/200 VUs  0m49.9s/4m00.0s

running (0m50.9s), 200/200 VUs, 46175 complete and 0 interrupted iterations
default   [  21% ] 200/200 VUs  0m50.9s/4m00.0s

running (0m51.9s), 200/200 VUs, 47160 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  0m51.9s/4m00.0s

running (0m52.9s), 200/200 VUs, 48125 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  0m52.9s/4m00.0s

running (0m53.9s), 200/200 VUs, 49125 complete and 0 interrupted iterations
default   [  22% ] 200/200 VUs  0m53.9s/4m00.0s

running (0m54.9s), 200/200 VUs, 50075 complete and 0 interrupted iterations
default   [  23% ] 200/200 VUs  0m54.9s/4m00.0s

running (0m55.9s), 200/200 VUs, 51075 complete and 0 interrupted iterations
default   [  23% ] 200/200 VUs  0m55.9s/4m00.0s

running (0m56.9s), 200/200 VUs, 52044 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  0m56.9s/4m00.0s

running (0m57.9s), 200/200 VUs, 53025 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  0m57.9s/4m00.0s

running (0m58.9s), 200/200 VUs, 54025 complete and 0 interrupted iterations
default   [  25% ] 200/200 VUs  0m58.9s/4m00.0s

running (0m59.9s), 200/200 VUs, 54975 complete and 0 interrupted iterations
default   [  25% ] 200/200 VUs  0m59.9s/4m00.0s

running (1m00.9s), 200/200 VUs, 55975 complete and 0 interrupted iterations
default   [  25% ] 200/200 VUs  1m00.9s/4m00.0s

running (1m01.9s), 200/200 VUs, 56940 complete and 0 interrupted iterations
default   [  26% ] 200/200 VUs  1m01.9s/4m00.0s

running (1m02.9s), 200/200 VUs, 57925 complete and 0 interrupted iterations
default   [  26% ] 200/200 VUs  1m02.9s/4m00.0s

running (1m03.9s), 200/200 VUs, 58925 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  1m03.9s/4m00.0s

running (1m04.9s), 200/200 VUs, 59875 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  1m04.9s/4m00.0s

running (1m05.9s), 200/200 VUs, 60875 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  1m05.9s/4m00.0s

running (1m06.9s), 200/200 VUs, 61838 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m06.9s/4m00.0s

running (1m07.9s), 200/200 VUs, 62825 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  1m07.9s/4m00.0s

running (1m08.9s), 200/200 VUs, 63811 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  1m08.9s/4m00.0s

running (1m09.9s), 200/200 VUs, 64775 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  1m09.9s/4m00.0s

running (1m10.9s), 200/200 VUs, 65775 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m10.9s/4m00.0s

running (1m11.9s), 200/200 VUs, 66737 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m11.9s/4m00.0s

running (1m12.9s), 200/200 VUs, 67725 complete and 0 interrupted iterations
default   [  30% ] 200/200 VUs  1m12.9s/4m00.0s

running (1m13.9s), 200/200 VUs, 68711 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  1m13.9s/4m00.0s

running (1m14.9s), 200/200 VUs, 69675 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  1m14.9s/4m00.0s

running (1m15.9s), 200/200 VUs, 70675 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m15.9s/4m00.0s

running (1m16.9s), 200/200 VUs, 71625 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m16.9s/4m00.0s

running (1m17.9s), 200/200 VUs, 72625 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  1m17.9s/4m00.0s

running (1m18.9s), 200/200 VUs, 73620 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  1m18.9s/4m00.0s

running (1m19.9s), 200/200 VUs, 74575 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  1m19.9s/4m00.0s

running (1m20.9s), 200/200 VUs, 75575 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m20.9s/4m00.0s

running (1m21.9s), 200/200 VUs, 76525 complete and 0 interrupted iterations
default   [  34% ] 200/200 VUs  1m21.9s/4m00.0s

running (1m22.9s), 200/200 VUs, 77525 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m22.9s/4m00.0s

running (1m23.9s), 200/200 VUs, 78501 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m23.9s/4m00.0s

running (1m24.9s), 200/200 VUs, 79475 complete and 0 interrupted iterations
default   [  35% ] 200/200 VUs  1m24.9s/4m00.0s

running (1m25.9s), 200/200 VUs, 80475 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  1m25.9s/4m00.0s

running (1m26.9s), 200/200 VUs, 81425 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  1m26.9s/4m00.0s

running (1m27.9s), 200/200 VUs, 82425 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  1m27.9s/4m00.0s

running (1m28.9s), 200/200 VUs, 83401 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  1m28.9s/4m00.0s

running (1m29.9s), 200/200 VUs, 84375 complete and 0 interrupted iterations
default   [  37% ] 200/200 VUs  1m29.9s/4m00.0s

running (1m30.9s), 200/200 VUs, 85375 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  1m30.9s/4m00.0s

running (1m31.9s), 200/200 VUs, 86325 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  1m31.9s/4m00.0s

running (1m32.9s), 200/200 VUs, 87325 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  1m32.9s/4m00.0s

running (1m33.9s), 200/200 VUs, 88286 complete and 0 interrupted iterations
default   [  39% ] 200/200 VUs  1m33.9s/4m00.0s

running (1m34.9s), 200/200 VUs, 89275 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  1m34.9s/4m00.0s

running (1m35.9s), 200/200 VUs, 90265 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  1m35.9s/4m00.0s

running (1m36.9s), 200/200 VUs, 91225 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  1m36.9s/4m00.0s

running (1m37.9s), 200/200 VUs, 92225 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  1m37.9s/4m00.0s

running (1m38.9s), 200/200 VUs, 93175 complete and 0 interrupted iterations
default   [  41% ] 200/200 VUs  1m38.9s/4m00.0s

running (1m39.9s), 200/200 VUs, 94175 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  1m39.9s/4m00.0s

running (1m40.9s), 200/200 VUs, 95141 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  1m40.9s/4m00.0s

running (1m41.9s), 200/200 VUs, 96125 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  1m41.9s/4m00.0s

running (1m42.9s), 200/200 VUs, 97125 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  1m42.9s/4m00.0s

running (1m43.9s), 200/200 VUs, 98075 complete and 0 interrupted iterations
default   [  43% ] 200/200 VUs  1m43.9s/4m00.0s

running (1m44.9s), 200/200 VUs, 99075 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  1m44.9s/4m00.0s

running (1m45.9s), 200/200 VUs, 100048 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  1m45.9s/4m00.0s

running (1m46.9s), 200/200 VUs, 101025 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  1m46.9s/4m00.0s

running (1m47.9s), 200/200 VUs, 102025 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  1m47.9s/4m00.0s

running (1m48.9s), 200/200 VUs, 102975 complete and 0 interrupted iterations
default   [  45% ] 200/200 VUs  1m48.9s/4m00.0s

running (1m49.9s), 200/200 VUs, 103975 complete and 0 interrupted iterations
default   [  46% ] 200/200 VUs  1m49.9s/4m00.0s

running (1m50.9s), 200/200 VUs, 104932 complete and 0 interrupted iterations
default   [  46% ] 200/200 VUs  1m50.9s/4m00.0s

running (1m51.9s), 200/200 VUs, 105925 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  1m51.9s/4m00.0s

running (1m52.9s), 200/200 VUs, 106910 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  1m52.9s/4m00.0s

running (1m53.9s), 200/200 VUs, 107875 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  1m53.9s/4m00.0s

running (1m54.9s), 200/200 VUs, 108875 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  1m54.9s/4m00.0s

running (1m55.9s), 200/200 VUs, 109825 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  1m55.9s/4m00.0s

running (1m56.9s), 200/200 VUs, 110825 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  1m56.9s/4m00.0s

running (1m57.9s), 200/200 VUs, 111797 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  1m57.9s/4m00.0s

running (1m58.9s), 200/200 VUs, 112775 complete and 0 interrupted iterations
default   [  50% ] 200/200 VUs  1m58.9s/4m00.0s

running (1m59.9s), 200/200 VUs, 113775 complete and 0 interrupted iterations
default   [  50% ] 200/200 VUs  1m59.9s/4m00.0s

running (2m00.9s), 200/200 VUs, 114725 complete and 0 interrupted iterations
default   [  50% ] 200/200 VUs  2m00.9s/4m00.0s

running (2m01.9s), 200/200 VUs, 115725 complete and 0 interrupted iterations
default   [  51% ] 200/200 VUs  2m01.9s/4m00.0s

running (2m02.9s), 200/200 VUs, 116685 complete and 0 interrupted iterations
default   [  51% ] 200/200 VUs  2m02.9s/4m00.0s

running (2m03.9s), 200/200 VUs, 117675 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  2m03.9s/4m00.0s

running (2m04.9s), 200/200 VUs, 118675 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  2m04.9s/4m00.0s

running (2m05.9s), 200/200 VUs, 119625 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  2m05.9s/4m00.0s

running (2m06.9s), 200/200 VUs, 120625 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  2m06.9s/4m00.0s

running (2m07.9s), 200/200 VUs, 121575 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  2m07.9s/4m00.0s

running (2m08.9s), 200/200 VUs, 122575 complete and 0 interrupted iterations
default   [  54% ] 200/200 VUs  2m08.9s/4m00.0s

running (2m09.9s), 200/200 VUs, 123572 complete and 0 interrupted iterations
default   [  54% ] 200/200 VUs  2m09.9s/4m00.0s

running (2m10.9s), 200/200 VUs, 124525 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  2m10.9s/4m00.0s

running (2m11.9s), 200/200 VUs, 125525 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  2m11.9s/4m00.0s

running (2m12.9s), 200/200 VUs, 126475 complete and 0 interrupted iterations
default   [  55% ] 200/200 VUs  2m12.9s/4m00.0s

running (2m13.9s), 200/200 VUs, 127475 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  2m13.9s/4m00.0s

running (2m14.9s), 200/200 VUs, 128458 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  2m14.9s/4m00.0s

running (2m15.9s), 200/200 VUs, 129425 complete and 0 interrupted iterations
default   [  57% ] 200/200 VUs  2m15.9s/4m00.0s

running (2m16.9s), 200/200 VUs, 130425 complete and 0 interrupted iterations
default   [  57% ] 200/200 VUs  2m16.9s/4m00.0s

running (2m17.9s), 200/200 VUs, 131375 complete and 0 interrupted iterations
default   [  57% ] 200/200 VUs  2m17.9s/4m00.0s

running (2m18.9s), 200/200 VUs, 132375 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  2m18.9s/4m00.0s

running (2m19.9s), 200/200 VUs, 133349 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  2m19.9s/4m00.0s

running (2m20.9s), 200/200 VUs, 134325 complete and 0 interrupted iterations
default   [  59% ] 200/200 VUs  2m20.9s/4m00.0s

running (2m21.9s), 200/200 VUs, 135325 complete and 0 interrupted iterations
default   [  59% ] 200/200 VUs  2m21.9s/4m00.0s

running (2m22.9s), 200/200 VUs, 136275 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  2m22.9s/4m00.0s

running (2m23.9s), 200/200 VUs, 137275 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  2m23.9s/4m00.0s

running (2m24.9s), 200/200 VUs, 138248 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  2m24.9s/4m00.0s

running (2m25.9s), 200/200 VUs, 139225 complete and 0 interrupted iterations
default   [  61% ] 200/200 VUs  2m25.9s/4m00.0s

running (2m26.9s), 200/200 VUs, 140225 complete and 0 interrupted iterations
default   [  61% ] 200/200 VUs  2m26.9s/4m00.0s

running (2m27.9s), 200/200 VUs, 141175 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  2m27.9s/4m00.0s

running (2m28.9s), 200/200 VUs, 142175 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  2m28.9s/4m00.0s

running (2m29.9s), 200/200 VUs, 143151 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  2m29.9s/4m00.0s

running (2m30.9s), 200/200 VUs, 144125 complete and 0 interrupted iterations
default   [  63% ] 200/200 VUs  2m30.9s/4m00.0s

running (2m31.9s), 200/200 VUs, 145125 complete and 0 interrupted iterations
default   [  63% ] 200/200 VUs  2m31.9s/4m00.0s

running (2m32.9s), 200/200 VUs, 146075 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  2m32.9s/4m00.0s

running (2m33.9s), 200/200 VUs, 147075 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  2m33.9s/4m00.0s

running (2m34.9s), 200/200 VUs, 148049 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  2m34.9s/4m00.0s

running (2m35.9s), 200/200 VUs, 149025 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  2m35.9s/4m00.0s

running (2m36.9s), 200/200 VUs, 150025 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  2m36.9s/4m00.0s

running (2m37.9s), 200/200 VUs, 150975 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  2m37.9s/4m00.0s

running (2m38.9s), 200/200 VUs, 151975 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  2m38.9s/4m00.0s

running (2m39.9s), 200/200 VUs, 152945 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m39.9s/4m00.0s

running (2m40.9s), 200/200 VUs, 153925 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m40.9s/4m00.0s

running (2m41.9s), 200/200 VUs, 154925 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m41.9s/4m00.0s

running (2m42.9s), 200/200 VUs, 155875 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m42.9s/4m00.0s

running (2m43.9s), 200/200 VUs, 156875 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m43.9s/4m00.0s

running (2m44.9s), 200/200 VUs, 157834 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m44.9s/4m00.0s

running (2m45.9s), 200/200 VUs, 158825 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m45.9s/4m00.0s

running (2m46.9s), 200/200 VUs, 159820 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m46.9s/4m00.0s

running (2m47.9s), 200/200 VUs, 160775 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m47.9s/4m00.0s

running (2m48.9s), 200/200 VUs, 161775 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m48.9s/4m00.0s

running (2m49.9s), 200/200 VUs, 162757 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m49.9s/4m00.0s

running (2m50.9s), 200/200 VUs, 163725 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m50.9s/4m00.0s

running (2m51.9s), 200/200 VUs, 164725 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m51.9s/4m00.0s

running (2m52.9s), 200/200 VUs, 165675 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m52.9s/4m00.0s

running (2m53.9s), 200/200 VUs, 166675 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m53.9s/4m00.0s

running (2m54.9s), 200/200 VUs, 167641 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m54.9s/4m00.0s

running (2m55.9s), 200/200 VUs, 168625 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m55.9s/4m00.0s

running (2m56.9s), 200/200 VUs, 169625 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m56.9s/4m00.0s

running (2m57.9s), 200/200 VUs, 170575 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m57.9s/4m00.0s

running (2m58.9s), 200/200 VUs, 171575 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m58.9s/4m00.0s

running (2m59.9s), 200/200 VUs, 172525 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m59.9s/4m00.0s

running (3m00.9s), 200/200 VUs, 173525 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  3m00.9s/4m00.0s

running (3m01.9s), 200/200 VUs, 174519 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  3m01.9s/4m00.0s

running (3m02.9s), 200/200 VUs, 175475 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  3m02.9s/4m00.0s

running (3m03.9s), 200/200 VUs, 176475 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  3m03.9s/4m00.0s

running (3m04.9s), 200/200 VUs, 177425 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  3m04.9s/4m00.0s

running (3m05.9s), 200/200 VUs, 178425 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  3m05.9s/4m00.0s

running (3m06.9s), 200/200 VUs, 179404 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  3m06.9s/4m00.0s

running (3m07.9s), 200/200 VUs, 180375 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  3m07.9s/4m00.0s

running (3m08.9s), 200/200 VUs, 181375 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  3m08.9s/4m00.0s

running (3m09.9s), 200/200 VUs, 182325 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  3m09.9s/4m00.0s

running (3m10.9s), 200/200 VUs, 183325 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  3m10.9s/4m00.0s

running (3m11.9s), 200/200 VUs, 184293 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  3m11.9s/4m00.0s

running (3m12.9s), 200/200 VUs, 185275 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  3m12.9s/4m00.0s

running (3m13.9s), 200/200 VUs, 186273 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  3m13.9s/4m00.0s

running (3m14.9s), 200/200 VUs, 187225 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  3m14.9s/4m00.0s

running (3m15.9s), 200/200 VUs, 188225 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  3m15.9s/4m00.0s

running (3m16.9s), 200/200 VUs, 189187 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  3m16.9s/4m00.0s

running (3m17.9s), 200/200 VUs, 190175 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  3m17.9s/4m00.0s

running (3m18.9s), 200/200 VUs, 191175 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  3m18.9s/4m00.0s

running (3m19.9s), 200/200 VUs, 192125 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  3m19.9s/4m00.0s

running (3m20.9s), 200/200 VUs, 193125 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  3m20.9s/4m00.0s

running (3m21.9s), 200/200 VUs, 194075 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  3m21.9s/4m00.0s

running (3m22.9s), 200/200 VUs, 195075 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  3m22.9s/4m00.0s

running (3m23.9s), 200/200 VUs, 196071 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  3m23.9s/4m00.0s

running (3m24.9s), 200/200 VUs, 197025 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  3m24.9s/4m00.0s

running (3m25.9s), 200/200 VUs, 198025 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  3m25.9s/4m00.0s

running (3m26.9s), 200/200 VUs, 198975 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  3m26.9s/4m00.0s

running (3m27.9s), 200/200 VUs, 199975 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  3m27.9s/4m00.0s

running (3m28.9s), 200/200 VUs, 200958 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  3m28.9s/4m00.0s

running (3m29.9s), 200/200 VUs, 201925 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  3m29.9s/4m00.0s

running (3m30.9s), 195/200 VUs, 202925 complete and 0 interrupted iterations
default   [  88% ] 195/200 VUs  3m30.9s/4m00.0s

running (3m31.9s), 188/200 VUs, 203875 complete and 0 interrupted iterations
default   [  88% ] 188/200 VUs  3m31.9s/4m00.0s

running (3m32.9s), 182/200 VUs, 204875 complete and 0 interrupted iterations
default   [  89% ] 182/200 VUs  3m32.9s/4m00.0s

running (3m33.9s), 175/200 VUs, 205843 complete and 0 interrupted iterations
default   [  89% ] 175/200 VUs  3m33.9s/4m00.0s

running (3m34.9s), 169/200 VUs, 206825 complete and 0 interrupted iterations
default   [  90% ] 169/200 VUs  3m34.9s/4m00.0s

running (3m35.9s), 161/200 VUs, 207823 complete and 0 interrupted iterations
default   [  90% ] 161/200 VUs  3m35.9s/4m00.0s

running (3m36.9s), 155/200 VUs, 208775 complete and 0 interrupted iterations
default   [  90% ] 155/200 VUs  3m36.9s/4m00.0s

running (3m37.9s), 148/200 VUs, 209775 complete and 0 interrupted iterations
default   [  91% ] 148/200 VUs  3m37.9s/4m00.0s

running (3m38.9s), 142/200 VUs, 210733 complete and 0 interrupted iterations
default   [  91% ] 142/200 VUs  3m38.9s/4m00.0s

running (3m39.9s), 135/200 VUs, 211725 complete and 0 interrupted iterations
default   [  92% ] 135/200 VUs  3m39.9s/4m00.0s

running (3m40.9s), 128/200 VUs, 212723 complete and 0 interrupted iterations
default   [  92% ] 128/200 VUs  3m40.9s/4m00.0s

running (3m41.9s), 121/200 VUs, 213675 complete and 0 interrupted iterations
default   [  92% ] 121/200 VUs  3m41.9s/4m00.0s

running (3m42.9s), 115/200 VUs, 214670 complete and 0 interrupted iterations
default   [  93% ] 115/200 VUs  3m42.9s/4m00.0s

running (3m43.9s), 108/200 VUs, 215625 complete and 0 interrupted iterations
default   [  93% ] 108/200 VUs  3m43.9s/4m00.0s

running (3m44.9s), 102/200 VUs, 216625 complete and 0 interrupted iterations
default   [  94% ] 102/200 VUs  3m44.9s/4m00.0s

running (3m45.9s), 094/200 VUs, 217608 complete and 0 interrupted iterations
default   [  94% ] 094/200 VUs  3m45.9s/4m00.0s

running (3m46.9s), 088/200 VUs, 218575 complete and 0 interrupted iterations
default   [  95% ] 088/200 VUs  3m46.9s/4m00.0s

running (3m47.9s), 081/200 VUs, 219575 complete and 0 interrupted iterations
default   [  95% ] 081/200 VUs  3m47.9s/4m00.0s

running (3m48.9s), 075/200 VUs, 220525 complete and 0 interrupted iterations
default   [  95% ] 075/200 VUs  3m48.9s/4m00.0s

running (3m49.9s), 068/200 VUs, 221525 complete and 0 interrupted iterations
default   [  96% ] 068/200 VUs  3m49.9s/4m00.0s

running (3m50.9s), 061/200 VUs, 222500 complete and 0 interrupted iterations
default   [  96% ] 061/200 VUs  3m50.9s/4m00.0s

running (3m51.9s), 055/200 VUs, 223475 complete and 0 interrupted iterations
default   [  97% ] 055/200 VUs  3m51.9s/4m00.0s

running (3m52.9s), 048/200 VUs, 224456 complete and 0 interrupted iterations
default   [  97% ] 048/200 VUs  3m52.9s/4m00.0s

running (3m53.9s), 041/200 VUs, 225319 complete and 0 interrupted iterations
default   [  97% ] 041/200 VUs  3m53.9s/4m00.0s

running (3m54.9s), 035/200 VUs, 226044 complete and 0 interrupted iterations
default   [  98% ] 035/200 VUs  3m54.9s/4m00.0s

running (3m55.9s), 028/200 VUs, 226661 complete and 0 interrupted iterations
default   [  98% ] 028/200 VUs  3m55.9s/4m00.0s

running (3m56.9s), 021/200 VUs, 227143 complete and 0 interrupted iterations
default   [  99% ] 021/200 VUs  3m56.9s/4m00.0s

running (3m57.9s), 015/200 VUs, 227487 complete and 0 interrupted iterations
default   [  99% ] 015/200 VUs  3m57.9s/4m00.0s

running (3m58.9s), 008/200 VUs, 227708 complete and 0 interrupted iterations
default   [ 100% ] 008/200 VUs  3m58.9s/4m00.0s

running (3m59.9s), 001/200 VUs, 227805 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  3m59.9s/4m00.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=204.92ms
    ✓ 'p(99)<10000' p(99)=210.62ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 911232  3796.110911/s
    checks_succeeded...: 100.00% 911232 out of 911232
    checks_failed......: 0.00%   0 out of 911232

    ✓ status is 200
    ✓ content-type is json
    ✓ workloadType is IO-BOUND
    ✓ executionTimeMs exists

    CUSTOM
    response_time_ms...............: min=50.788852 avg=184.326304 med=203.78994 max=227.074603 p(90)=204.568554 p(95)=204.928384 p(99)=210.627904
    successful_requests............: 227808 949.027728/s

    HTTP
    http_req_duration..............: min=50.78ms   avg=184.32ms   med=203.78ms  max=227.07ms   p(90)=204.56ms   p(95)=204.92ms   p(99)=210.62ms  
      { expected_response:true }...: min=50.78ms   avg=184.32ms   med=203.78ms  max=227.07ms   p(90)=204.56ms   p(95)=204.92ms   p(99)=210.62ms  
    http_req_failed................: 0.00%  0 out of 227808
    http_reqs......................: 227808 949.027728/s

    EXECUTION
    iteration_duration.............: min=50.9ms    avg=184.46ms   med=203.92ms  max=227.36ms   p(90)=204.7ms    p(95)=205.07ms   p(99)=210.79ms  
    iterations.....................: 227808 949.027728/s
    vus............................: 1      min=1           max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 50 MB  210 kB/s
    data_sent......................: 18 MB  75 kB/s



running (4m00.0s), 000/200 VUs, 227808 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  4m0s